ATsupportum/src/InformationRegisters/АдресаВременныхХранилищ_ат/АдресаВременныхХранилищ_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АдресаВременныхХранилищ_ат</name>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресВременногоХранилища</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>УникальныйИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/CommonModules/ПодключениеКИБ_ПовтИсп_ат/Module.bsl
Функция   ПолучитьАдресХранилищаПодключений() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	АдресаВременныхХранилищ_ат.АдресВременногоХранилища
		|ИЗ
		|	РегистрСведений.АдресаВременныхХранилищ_ат КАК АдресаВременныхХранилищ_ат
		|ГДЕ
		|	АдресаВременныхХранилищ_ат.УникальныйИдентификаторПользователяИБ = &УникальныйИдентификатор");
	Запрос.УстановитьПараметр("УникальныйИдентификатор", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда 
		
		АдресВременногоХранилища = Выборка.АдресВременногоХранилища;
		
		Если ТипЗнч(ПолучитьИзВременногоХранилища(АдресВременногоХранилища)) = Тип("Структура") Тогда
			Возврат АдресВременногоХранилища;
		Иначе 
			Возврат ПодключениеКИБ_ат.СоздатьВременноеХранилище();
		КонецЕсли;
		
	Иначе
		
		Возврат ПодключениеКИБ_ат.СоздатьВременноеХранилище();
		
	КонецЕсли;
	
КонецФункции
